<template lang="pug">
  v-container
    v-row.backgroundColor.elevation-6.ma-4.textsColor
      v-col
        div.text-h5.mb-4.mt-2.font-weight-bold.ml-3 Что это такое?
        div.font-weight-bold.mb-4.ml-3 Система автоматического подбора собеседников - это средство эффективного поиска новых знакомств c помощью использования данных о качествах личности людей. Благодаря этому вы сможете явно указать, какие качества личности другого человека интересуют вас больше всего, а система сможет учесть ваши предпочтения и предложит самых подходящих кандидатов.
        div.font-weight-bold.mb-4.ml-3 Помимо этого, система использует привычную систему фильтрации поиска - вы можете указать:
        div.font-weight-bold.ml-3 - цель вашего знакомства, чтобы вы всегда были уверены, что человек по ту сторону экрана заинтересован в том же, в чем и вы;
        div.font-weight-bold.ml-3 - регион, чтобы вы имели возможность беспрепятственно встретиться с найденным человеком;
        div.font-weight-bold.ml-3 - ваш возраст, чтобы избежать ситуации огромной разницы в возрасте с найденным человеком;
        div.font-weight-bold.ml-3 - ваши интересы, чтобы вам всегда было что обсудить с найденным человеком;
        div.font-weight-bold.mb-2.ml-3 - и множество других параметров, которые вы сможете найти в разделах "Мой профиль" и "Найти знакомство".
    v-row.backgroundColor.elevation-6.ma-4.textsColor
      v-col
        div.text-h5.mb-4.mt-2.font-weight-bold.ml-3 Как это работает?
        div.font-weight-bold.mb-4.ml-3 Каждый пользователь в системе может начать поиск новых знакомств. Как только это произошло, система автоматически начнет искать для него другого пользователя, учитывая параметры, указанные в его профиле и в настройках поиска, а также используя данные, полученные системой после прохождения пользователем тестирования на выраженность акцентуаций характера.
        div.font-weight-bold.mb-4.ml-3 Тестирование на выраженность акцентуаций характера - это способ получения системой данных о качествах личности пользователей. Он основан на тесте личностных акцентуаций "Чертова дюжина" 1994 г. авторов А.С. Прутченкова и А.А. Сиялова, разработавших его на основании классификации акцентуаций, созданной П.Б. Ганнушкиным и дополненной К. Леонгардом.
        div.font-weight-bold.mb-4.ml-3 Прошедший это тестирование пользователь получает описание выраженности его акцентуаций характера. Важно, что выраженность той или иной акцентуации может прямо трактоваться как качество личности. К примеру, человека с выраженной лабильной акцентуацией характера можно уверенно назвать неряшливым и чувствительным к словам.
        div.font-weight-bold.mb-2.ml-3 Благодаря этому и достигается высокая результативность знакомств - система никогда не предложит вам "Кота в мешке", вы всегда сможете ожидать, что человек по ту сторону экрана подходит вашим интересам, а вы - подходите интересам вашего собеседника.
    v-row.backgroundColor.elevation-6.ma-4.textsColor
      v-col
        div.text-h5.mb-4.mt-2.font-weight-bold.ml-3 Что нужно, чтобы этим воспользоваться?
        div.font-weight-bold.mb-4.ml-3 Для полноценной работы поиска вам необходимо:
        div.font-weight-bold.ml-3 - заполнить ваш профиль (раздел "Мой профиль" в шапке страницы);
        div.font-weight-bold.ml-3 - настроить поиск (раздел "Найти знакомство" в шапке страницы, пункт "Настроить поиск");
        div.font-weight-bold.ml-3 - пройти тестирование на выраженность акцентуаций характера (раздел "Пройти тестирование").
        div.font-weight-bold.mb-4.ml-3 Важные правила:
        div.font-weight-bold.ml-3 - тестирование нужно пройти от начала до конца за один подход, система не сохраняет ваши промежуточные результаты;
        div.font-weight-bold.ml-3 - заполнить следует все возможные поля. Если некоторые поля останутся пусты, система предложит вам человека, у которого не заполнены точно такие же поля.
        div.font-weight-bold.ml-3.mb-2 - от выбора цели знакомства зависит вся процедура подбора человека. Так, если целью указаны отношения, поиск не учитывает интересы; если целью указана дружба, поиск не учитывает взгляды на семью; если указаны общение или развлечение, поиск учитывает ТОЛЬКО интересы - разница в том, что вы сразу понимаете, в какое русло стоит вести диалог: просто поговорить на различные темы, или найти способ провести время.
</template>

<script>
export default {
  name: "MainView"
}
</script>

<style scoped>
.textsColor{
  color: #1976D2
}
.backgroundColor{
  background-color: white
}
</style>